# TemperatureRatingTypeSet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet Class
Members See Also
---
A set that contains TemperatureRating types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TemperatureRatingTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class TemperatureRatingTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class TemperatureRatingTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeSet
# See Also
TemperatureRatingTypeSet Members
Autodesk.Revit.DB.Electrical Namespace